[
  {
    "title": "Technical Lead – AI Engineering",
    "company": "Royal Bank of Canada (RBC)",
    "period": "Jan 2023 - Present",
    "description": "Two times award winning Tech-Lead guiding a team of seven engineers in multiple complex projects spearheading the proposal and designing new technologies at RBC.",
    "achievements": [
      "Won the Leadership Model Award of 2023 in the RBC's Technology and Operations department.",
      "Spearheaded the adoption of Large Language Models (LLMs) into RBC's DevOps department, resulting in three key products: 1) An LLM-powered ticket analysis and resolution system reducing average ticket closing time by 27%, 2) A developer chatbot assistant integrated with multiple knowledge-bases using advanced RAG and LLM-agents, and 3) An AI Slack Bot automatically resolving 22% of issues using collaborating LLM-agents.",
      "Played a key role in transitioning RBC's main DevOps platform from Jenkins to GitHub Actions by establishing infrastructure for hosting runners on Azure and OCP4.",
      "Conducted extensive analysis of DevOps usage data and proved that GitHub Actions improved CI/CD pipeline execution time up to 3.5x.",
      "Introduced a new metric called \"Consecutive Failure\" changing the way RBC measures DevOps systems productivity.",
      "Successfully mentored and guided three interns in multiple projects exceptionally improving their team working and coding skills."
    ]
  },
  {
    "title": "Software Engineer & Technical Co-Founder",
    "company": "Porsline",
    "period": "Aug 2016 - Aug 2020",
    "description": "Porsline is the most successful online survey software company in the founding country, Turkey and the Middle East. The software is built for business developers and researchers to create smart questionnaires and analyze the results effectively.",
    "achievements": [
      "Laid the foundation of the company's main software and helped recruit and develop the tech-team.",
      "Reengineered the underlying backend for the reporting subsystem, improving performance by 15x.",
      "Implemented and designed the Front-End (AngularJS) and Back-End API (Django) for creating and editing surveys, one of the most used features of the product.",
      "Developed a scheduled-notifications system for survey responses as a microservice, posting now up to millions of notifications per day using Python Asyncio, crontab, and RabbitMQ."
    ]
  }
]